#
# Auto-generated using `brew bundle --dump --describe`.
#
tap "blacktop/tap"
tap "buo/cask-upgrade"
tap "cirruslabs/cli"

brew "argp-standalone"
brew "aria2"
brew "bash"
brew "bat"
brew "binutils"
brew "binwalk"
brew "bison"
brew "btop"
brew "ca-certificates"
brew "capstone"
brew "clang-format"
brew "cmake"
brew "coreutils"
brew "curl", link: true
brew "dasel"
brew "deno"
brew "difftastic"
brew "displayplacer"
brew "dnscrypt-proxy"
brew "exiftool"
brew "eza"
brew "fd"
brew "fish"
brew "flex"
brew "fpp"
brew "fzf"
brew "gh"
brew "git-delta"
brew "git-lfs"
brew "git"
brew "glow"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "goreleaser"
brew "gradle"
brew "graphicsmagick"
brew "graphviz"
brew "gum"
brew "httpie"
brew "ideviceinstaller"
brew "imagemagick"
brew "ios-deploy"
brew "isort"
brew "jless"
brew "jq"
brew "lazygit"
brew "libimobiledevice"
brew "libmagic"
brew "libplist"
brew "libusb"
brew "libusbmuxd"
brew "libuv"
brew "lla" # Blazing Fast ls Replacement with Superpowers
brew "llvm"
brew "loc"
brew "luajit-openresty"
brew "lzfse"
brew "moreutils"
brew "neovim"
brew "ninja"
brew "node"
brew "openssl@3"
brew "p7zip"
brew "pam-reattach"
brew "pbzx"
brew "pinentry-mac"
brew "pipenv"
brew "pipx"
brew "pkg-config"
brew "podman"
brew "poetry"
brew "postgresql@17"
brew "protobuf"
brew "pyenv"
brew "python@3.13"
brew "qemu"
brew "radare2"
brew "reattach-to-user-namespace"
brew "ripgrep-all"
brew "ruby"
brew "ruff"
brew "rustup-init"
# brew "secretive"
brew "semgrep"
brew "snapcraft"
brew "socat"
brew "sqlite"
# brew "starship" # fish prompt
brew "terminal-notifier"
brew "termshark"
brew "tmux"
brew "tmuxinator"
brew "tree-sitter"
brew "tree"
brew "unicorn"
brew "uv"
brew "vhs"
brew "viddy"
brew "watch"
brew "weggli"
brew "wget"
brew "wireshark"
brew "xz"
brew "yazi"
brew "z3"
brew "zigup"
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "anchore/syft/syft"
brew "oven-sh/bun/bun"
# Mine
brew "blacktop/tap/apfs"
brew "blacktop/tap/ipsw"
brew "blacktop/tap/lporg"
# XCode
brew "xcodes"
# Tart
brew "tart"
# Charm
brew "vhs"


# Casks
cask "010-editor"
cask "blacktop/tap/ghidra-app"
cask "bindiff"
cask "blockblock"
cask "codeql"
cask "db-browser-for-sqlite"
# cask "docker"
cask "font-cousine-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "ghostty@tip"
cask "github"
cask "github"
cask "gpg-suite-no-mail"
cask "iterm2"
cask "kap" # Screen recorder
cask "keycastr" # Show keystrokes
cask "knockknock"
cask "lm-studio"
cask "lulu"
cask "netiquette"
cask "obsidian"
cask "ollama"
cask "oversight"
cask "raycast" # Spotlight on steroids
cask "rectangle"
cask "reikey"
cask "tableplus"
cask "temurin"
# cask "tunnelblick"
# cask "viscosity"
cask "visual-studio-code"
# cask "wireshark"
cask "xquartz"
cask "zed"
