#
# Auto-generated using `brew bundle --dump --describe`.
#
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "anchore/syft"
tap "blacktop/tap"
tap "buo/cask-upgrade"
tap "cirruslabs/cli"
tap "robotsandpencils/made"
tap "charmbracelet/tap"

brew "argp-standalone"
brew "sqlite"
brew "aria2"
brew "bash"
brew "bat"
brew "binutils"
brew "pkg-config"
brew "xz"
brew "binwalk"
brew "bison"
brew "ca-certificates"
brew "capstone"
brew "clang-format"
brew "cmake"
brew "coreutils"
brew "curl", link: true
brew "dasel"
brew "displayplacer"
brew "dive"
brew "dnscrypt-proxy"
brew "exiftool"
brew "fd"
brew "fish"
brew "flex"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "goreleaser"
brew "gradle"
brew "graphviz"
brew "gum"
brew "glow"
brew "httpie"
brew "hugo"
brew "imagemagick"
brew "graphicsmagick"
brew "ideviceinstaller"
brew "ios-deploy"
brew "jless"
brew "jq"
brew "libimobiledevice"
brew "libuv"
brew "libusb"
brew "loc"
brew "luajit-openresty"
brew "lzfse"
brew "moreutils"
brew "neovim"
brew "node"
brew "openssl@3"
brew "pinentry-mac"
brew "pipenv"
brew "podman"
brew "poetry"
brew "pyenv"
brew "python@3.10"
brew "qemu"
brew "ripgrep-all"
brew "ruby"
brew "rustup-init"
brew "reattach-to-user-namespace"
brew "secretive"
brew "semgrep"
brew "snapcraft"
brew "socat"
brew "starship" # fish prompt
brew "terminal-notifier"
brew "wireshark"
brew "termshark"
brew "tmux"
brew "tmuxinator"
brew "tree"
brew "tree-sitter"
brew "unicorn"
brew "watch"
brew "weggli"
brew "wget"
brew "zig"
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "anchore/syft/syft"
# Mine
brew "blacktop/tap/apfs"
brew "blacktop/tap/ipsw"
brew "blacktop/tap/lporg"
# XCode
brew "robotsandpencils/made/xcodes"
# Tart
brew "cirruslabs/cli/tart"
# Charm
brew "charmbracelet/tap/mods"
brew "charmbracelet/tap/vhs"
brew "charmbracelet/tap/freeze"


# Casks
cask "010-editor"
cask "blockblock"
cask "codeql"
cask "oversight"
cask "reikey"
cask "netiquette"
cask "lulu"
cask "knockknock"
cask "docker"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "blacktop/tap/ghidra-app"
cask "github"
cask "gpg-suite-no-mail"
cask "insomnia"
cask "iterm2"
cask "rectangle"
cask "temurin"
cask "tunnelblick"
cask "viscosity"
cask "visual-studio-code"
cask "xquartz"
cask "db-browser-for-sqlite"
cask "keycastr" # Show keystrokes
cask "kap" # Screen recorder
cask "raycast" # Spotlight on steroids
